Namespace:   Autodesk.Revit.DB.IFC
  Assembly:   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public void ProcessIFCProject(
	IFCAnyHandle ifcProject,
	IDictionary<IFCAnyHandle, ElementId> createdElements
)
  Visual Basic
Public Sub ProcessIFCProject ( _
	ifcProject As IFCAnyHandle, _
	createdElements As IDictionary(Of IFCAnyHandle, ElementId) _
)
  Visual C++
public:
void ProcessIFCProject(
	IFCAnyHandle^ ifcProject,
	IDictionary<IFCAnyHandle^, ElementId^>^ createdElements
)
 Parameters
  ifcProject
 Type:  Autodesk.Revit.DB.IFC IFCAnyHandle
  createdElements
 Type:  System.Collections.Generic IDictionary   IFCAnyHandle  ,  ElementId
 See Also
  ImporterIFC Class
  ProcessIFCProject Overload
  Autodesk.Revit.DB.IFC Namespace